tutorials/pnpMultiFoam/oneDReaction/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs
(
 	"libelectrokineticFoam.so"
 	"libmultiformFoam.so"
);

application     scalarMultiRegionFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    runTime;

writeInterval   1;

purgeWrite      0;

writeFormat     binary;

writePrecision  12;

writeCompression off;

timePrecision   3;

runTimeModifiable true;


functions
{
  	#includeFunc singleGraphFluid
  	#includeFunc singleGraphSolid
}

// ************************************************************************* //
