tutorials/pnpMultiFoam/oneDReaction/0/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/constant/initialConditions";

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pInitial;

boundaryField
{
    fluidOuterWall
    {
        type            calculated;
        value           uniform $pInitial;
    }

    fluid_to_solid
    {
        $fluidOuterWall;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
