tutorials/pnpMultiFoam/oneDReaction/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "system/fluid";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    T
    {
        solver          PBiCG;
        smoother        GaussSeidel;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          1e-8;
    }

    "TFinal"
    {
        $T;
        relTol           1e-8;
    }


}

PIMPLE
{
    outerCorrectorResidualControl //residualControl
    {
        ".*"
        {
            tolerance 1e-11;
            relTol    1e-11;
        }

    }
    residualControl
    {
        ".*"   1e-11;

    }

    }
    nCorrectors     4;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    equations
    {
        ".*" .9;
    }
}

// ************************************************************************* //
