tutorials/pnpMultiFoam/oneDReaction/system/solid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "system/solid";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "T"
    {
        solver           PCG;
        smoother         GaussSeidel;
        preconditioner   FDIC;
        tolerance        1e-12;
        relTol           1e-8;
    }

    "TFinal"
    {
        $T;
        relTol           1e-8;
    }
}

PIMPLE
{
    outerCorrectorResidualControl //residualControl
    {
        ".*"
        {
            tolerance 1e-11;
            relTol    1e-11;
        }

    }
    residualControl
    {
        ".*"   1e-11;//1e-12

    }
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    equations
    {
        ".*" 0.9;
    }
}

// ************************************************************************* //
