tutorials/pnpMultiFoam/oneDReaction/system/fluid/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/fluid";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// homoReactionSource
// {
//     type            scalarSemiImplicitSource;
    

//     scalarSemiImplicitSourceCoeffs
//     {
//         selectionMode   cellZone;
//         cellZone        fluid;
//         volumeMode      specific;

//         injectionRateSuSp
//         {
//             T       (0 0.00045);
//         }
//     }

// }


// ************************************************************************* //