tutorials/pnpMultiFoam/oneDReaction/Allmesh
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
#runApplication topoSet
#runApplication transformPoints -scale  "(1e-3 1e-3 1e-3)"

runApplication splitMeshRegions -cellZones -defaultRegionName fluid -overwrite

#------------------------------------------------------------------------------
